package main

import "fmt"

func main() {
	
	//實現判斷一個整數屬於哪個範圍 >0,<0,=0
	
	//判斷一個年份是否為閏年
	
	//判斷一個整數是否為水仙花數
	
	//寫出輸出結果
	/* m := 0
	   n := 3
	   if m = 0 {
	   if n = 2 {
	   fmt.Println("A")
	   } else {
	   fmt.Println("B")
	   }
	   }
	   */
	   
	//保存用戶名和密碼，判斷用戶是否為張三，密碼是否為1234，如果是則提示登入成功，不是則提示登入失敗
	
	//請輸入一個月份，判斷出當月有幾天（switch）
	
	//開發一款軟件，根據提示(身高-108)*2=體重，可以有10公斤的浮動，觀察體重是否合適
	
	//輸入一個成績，判斷區間，90-100優秀，80-89優良，70-79良好，60-69及格，60以下不及格
	
	//有a,b兩個數，如果a能夠被b整除或a+b大於1000，則輸出a，否則則輸出b
	
	//實現輸入三個整數自動進行排序，由小到大輸出
}